system/blockMeshDictOld
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Meshing is split up in 4 refinement zones, as specified in "On the Assessment of Numerical Wave Makers in \
// \ CFD Simulations"
convertToMeters 1;

vertices        
(
/*(x: wave direction (wave generation and absorption condition), y: tank width, z: tank depth*/
// Water Block (From -d to -H)
// NWT Length is 1 * Wavelength
// Wave Height is 0.1 m // Wave Height of 0.2 m was close to breaking limit
    (  -1.740893455  -1.25 -1.15)
    ( 1.740893455  -1.25 -1.15)
    (  -1.740893455   -1.25 0.25)
    (1.740893455  -1.25 0.25)
                 
    (  -1.740893455 1.25  -1.15)
    ( 1.740893455  1.25 -1.15)
    (  -1.740893455   1.25 0.25)
    ( 1.740893455   1.25 0.25)    

// Free Surface Block (From -H to H)
    (  -1.740893455  -1.25 0.25)
    ( 1.740893455  -1.25 0.25)
    (  -1.740893455   -1.25 0.45)
    (1.740893455  -1.25 0.45)
                 
    (  -1.740893455 1.25  0.25)
    ( 1.740893455  1.25 0.25)
    (  -1.740893455   1.25 0.45)
    ( 1.740893455   1.25 0.45)    

// Air Block (From H to 2H)
    (  -1.740893455  -1.25 0.45)
    ( 1.740893455  -1.25 0.45)
    (  -1.740893455   -1.25 1.05)
    (1.740893455  -1.25 1.05)
                 
    (  -1.740893455 1.25  0.45)
    ( 1.740893455  1.25 0.45)
    (  -1.740893455   1.25 1.05)
    ( 1.740893455   1.25 1.05)    
        
);

blocks          
(
// WATER Block
    hex (0 1 5 4 2 3 7 6) ( 87 63 35) simpleGrading (1 1 1)
// Free Surface Block
	hex (8 9 13 12 10 11 15 14) ( 174 125 20) simpleGrading (1 1 1)
// Air Block
	hex (16 17 21 20 18 19 23 22) ( 44 31 6 ) simpleGrading (1 1 1)

);

edges           
(
);

patches         
(
    patch inlet
    (
    (0 4 6 2)
	(8 12 14 10)
	(16 20 22 18)
    )
    wall bottom 
    (
    (0 1 5 4)
    )
    patch outlet
    (
    (1 5 7 3)
	(9 13 15 11)
	(17 21 23 19)
    )

    patch atmosphere 
    (
    (18 19 23 22)
    )
    empty frontBack
    (
    (0 1 3 2)
	(8 9 11 10)
	(16 17 19 18)
	(4 5 7 6)
	(12 13 15 14)
	(20 21 23 22)
    )
	patch interfaceWaterPlus
	(
	(2 3 7 6)
	)
	patch interfaceFreeMinus
	(
	(8 9 13 12)
	)
	patch interfaceFreePlus
	(
	(10 11 15 14)
	)
	patch interfaceAirMinus
	(
	(16 17 21 20)
	)
);

mergePatchPairs
(
// This merging is not perfect unfortunately (rounding errors, not nice integer numbers for numerical zone length)
	(interfaceFreeMinus interfaceWaterPlus)
	(interfaceFreePlus interfaceAirMinus)
);

// ************************************************************************* //
