Allrun
#!/bin/sh
#cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

#runApplication surfaceFeatureExtract 
#runApplication blockMesh
#restore0Dir
#runApplication snappyHexMesh -overwrite
#runApplication setFields
#runApplication decomposePar -force
mpirun -np 6 interDyMFoam -parallel > log.interDyMFoam 

#------------------------------------------------------------------------------
